 #+title: Signal Processing for Pixelated LarTPC
#+EXPORT_FILE_NAME: index.html
#+setupfile: docs/setup-rto.org

* Introduction

This package provides charge reconstruction of pixle-based LarTPC detectors

* Install

~PixSi~ installs in the "usual Python way".  Use of ~pip~ and a Python
virtual environment is recommended.

#+begin_example
python3 -m venv venv
source venv/bin/activiate
git clone https://github.com/rennney/PixSi.git
cd PixSi
pip install -e .
#+end_example

* Usage

The ~pixsi~ command line user interface provides online help:

#+begin_src shell :exports both :results output code :wrap example
pixsi
#+end_src

#+RESULTS:
#+begin_example
Usage: pixsi [OPTIONS] COMMAND [ARGS]...

  PixSi command line interface

Options:
  -s, --store PATH     File for primary data storage (input/output)
  -o, --outstore PATH  File for output (primary only input)
  --help               Show this message and exit.

Commands:
  eval               Evaluate Hits
  eval-tred          Evaluate Hits created from TRED
  eval-tred-true     Evaluate Hits created from TRED
  run-1d             Toy Sim + SP for a single pixel
  run-2d             Toy Sim + SP for two MIP tracks [NO long-range ind.]
  run-2d-full        Toy Sim + SP for two MIP tracks with +-1 pixle for
                     long...

  run-sp-tred        Run Signal Processing on TRED output
  run-sp-tred-burst  Run Signal Processing on TRED output with simulated...
#+end_example

